Backend/XML_backend/XML_agent/test.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Body>
    <ns0:newRoomRequest xmlns:ns0="http://www.team17.xml.ftn.uns.ac.rs/NewRoom">
      <ns0:room>
        <ns0:address>
          <ns0:country>Srbija</ns0:country>
          <ns0:state>Vojvodina</ns0:state>
          <ns0:city>Novi Sad</ns0:city>
          <ns0:postalCode>21000</ns0:postalCode>
          <ns0:street>Novosadskog sajma</ns0:street>
          <ns0:streetNumber>35</ns0:streetNumber>
          <ns0:lat>45.252743</ns0:lat>
          <ns0:lng>19.826981</ns0:lng>
        </ns0:address>
        <ns0:type>
          <ns0:id>1</ns0:id>
        </ns0:type>
        <ns0:category>
          <ns0:id>5</ns0:id>
        </ns0:category>
        <ns0:defaultPrice>25</ns0:defaultPrice>
        <ns0:numberOfPeople>2</ns0:numberOfPeople>
        <ns0:cancelationDays>2</ns0:cancelationDays>
        <ns0:additionalServices>
          <ns0:id>1</ns0:id>
        </ns0:additionalServices>
        <ns0:additionalServices>
          <ns0:id>2</ns0:id>
        </ns0:additionalServices>
        <ns0:additionalServices>
          <ns0:id>3</ns0:id>
        </ns0:additionalServices>
        <ns0:additionalServices>
          <ns0:id>4</ns0:id>
        </ns0:additionalServices>
        <ns0:additionalServices>
          <ns0:id>5</ns0:id>
        </ns0:additionalServices>
        <ns0:description>Hotel Park je sme&#353;ten na obodu velikog parka u Novom Sadu. Ovaj potpuno klimatizovan hotel u ponudi ima elegantno opremljene sme&#353;tajne jedinice sa besplatnim internetom. Bezbedan parking u sklopu objekta mo&#382;e se besplatno koristiti.</ns0:description>
        <ns0:floor>1</ns0:floor>
        <ns0:roomNumber>131</ns0:roomNumber>
      </ns0:room>
    </ns0:newRoomRequest>
  </soap-env:Body>
</soap-env:Envelope>
